from PyroUbot import *


__MODULE__ = "ɪᴘ-ɪɴғᴏ"
__HELP__ = f"""
<b>📚<u>Bantuan Untuk IpInfo</u></b>

  <b>🚦Perintah:</b> <code>{0}ipinfo</code> [ip addreꜱ]
  <b>🦠Penjelasan:</b> Untuk Mendapatkan Informasi IP Addres 
  """


@PY.UBOT("ipinfo")
async def _(client, message):
ᴀsʏɴᴄ ᴅᴇғ ʜᴀᴄᴋᴇʀ_ʟᴀᴄᴀᴋ_ᴛᴀʀɢᴇᴛ(ᴄʟɪᴇɴᴛ, ᴍᴇssᴀɢᴇ):
    ᴀᴘɪᴋᴇʏ = ᴋᴄ("ᴍ𝟶ǫᴡɴ𝟶ᴜʏʀᴜғʙʀᴊᴜ𝟷ᴏᴛǫᴡǫᴜʏ𝟶ɴᴅᴄᴢɴᴇᴍᴢʀᴊᴊʙǫᴢᴅᴅᴍᴜᴇ=").ᴅᴇᴄᴏᴅᴇ("ᴜᴛғ-𝟾")
    ʀᴀɴ = ᴀᴡᴀɪᴛ ᴍᴇssᴀɢᴇ.ʀᴇᴘʟʏ_ᴛᴇxᴛ("<ᴄᴏᴅᴇ>ᴘʀᴏᴄᴇssɪɴɢ</ᴄᴏᴅᴇ>")
    ɪᴘᴅᴅʀᴇs = ᴍᴇssᴀɢᴇ.ᴛᴇxᴛ.sᴘʟɪᴛ(ɴᴏɴᴇ, 𝟷)[𝟷] ɪғ ʟᴇɴ(ᴍᴇssᴀɢᴇ.ᴄᴏᴍᴍᴀɴᴅ) != 𝟷 ᴇʟsᴇ ɴᴏɴᴇ
    ɪғ ɴᴏᴛ ɪᴘᴅᴅʀᴇs:
        ᴀᴡᴀɪᴛ ʀᴀɴ.ᴇᴅɪᴛ_ᴛᴇxᴛ(
            "ᴇxᴀᴍᴘʟᴇ: <code>+ɪᴘ ʏᴏᴜʀ ɪᴘ ᴀᴅᴅʀᴇss ʜᴇʀᴇ : 𝟷𝟻𝟿𝟸.𝟺𝟶𝟷.xxx</ᴄᴏᴅᴇ>"
        )
        ʀᴇᴛᴜʀɴ

    ɪғ ɴᴏᴛ ᴀᴘɪᴋᴇʏ:
        ᴀᴡᴀɪᴛ ʀᴀɴ.ᴇᴅɪᴛ_ᴛᴇxᴛ("ᴍɪssɪɴɢ ᴀᴘɪᴋᴇʏ ɪᴘ ʟᴏᴄᴀᴛɪᴏɴ")
        ʀᴇᴛᴜʀɴ

    ʟᴏᴄᴀᴛɪᴏɴ_ʟɪɴᴋ = "ʜᴛᴛᴘs"
    ʟᴏᴄᴀᴛɪᴏɴ_ᴀᴘɪ = "ᴀᴘɪ.ɪᴘ𝟸ʟᴏᴄᴀᴛɪᴏɴ.ɪᴏ"
    ʟᴏᴄᴀᴛɪᴏɴ_ᴋᴇʏ = ғ"ᴋᴇʏ={ᴀᴘɪᴋᴇʏ}"
    ʟᴏᴄᴀᴛɪᴏɴ_sᴇᴀʀᴄʜ = ғ"ɪᴘ={ɪᴘᴅᴅʀᴇs}"
    ʟᴏᴄᴀᴛɪᴏɴ_ᴘᴀʀᴀᴍ = (
        ғ"{ʟᴏᴄᴀᴛɪᴏɴ_ʟɪɴᴋ}://{ʟᴏᴄᴀᴛɪᴏɴ_ᴀᴘɪ}/?{ʟᴏᴄᴀᴛɪᴏɴ_ᴋᴇʏ}&{ʟᴏᴄᴀᴛɪᴏɴ_sᴇᴀʀᴄʜ}"
    )
    ʀᴇsᴘᴏɴsᴇ = ʀᴇǫᴜᴇsᴛs.ɢᴇᴛ(ʟᴏᴄᴀᴛɪᴏɴ_ᴘᴀʀᴀᴍ)
    ɪғ ʀᴇsᴘᴏɴsᴇ.sᴛᴀᴛᴜs_ᴄᴏᴅᴇ == 𝟸𝟶𝟶:
        ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ = ʀᴇsᴘᴏɴsᴇ.ᴊsᴏɴ()
        ᴛʀʏ:
            ʟᴏᴄᴀᴛɪᴏɴ_ɪᴘ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ɪᴘ"]
            ʟᴏᴄᴀᴛɪᴏɴ_ᴄᴏᴅᴇ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ᴄᴏᴜɴᴛʀʏ_ᴄᴏᴅᴇ"]
            ʟᴏᴄᴀᴛɪᴏɴ_ɴᴀᴍᴇ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ᴄᴏᴜɴᴛʀʏ_ɴᴀᴍᴇ"]
            ʟᴏᴄᴀᴛɪᴏɴ_ʀᴇɢɪᴏɴ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ʀᴇɢɪᴏɴ_ɴᴀᴍᴇ"]
            ʟᴏᴄᴀᴛɪᴏɴ_ᴄɪᴛʏ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ᴄɪᴛʏ_ɴᴀᴍᴇ"]
            ʟᴏᴄᴀᴛɪᴏɴ_ᴢɪᴘ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ᴢɪᴘ_ᴄᴏᴅᴇ"]
            ʟᴏᴄᴀᴛɪᴏɴ_ᴢᴏɴᴇ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ᴛɪᴍᴇ_ᴢᴏɴᴇ"]
            ʟᴏᴄᴀᴛɪᴏɴ_ᴄᴀʀᴅ = ᴅᴀᴛᴀ_ʟᴏᴄᴀᴛɪᴏɴ["ᴀs"]
        ᴇxᴄᴇᴘᴛ ᴇxᴄᴇᴘᴛɪᴏɴ ᴀs ᴇ:
            ᴀᴡᴀɪᴛ ʀᴀɴ.ᴇᴅɪᴛ_ᴛᴇxᴛ(ғ"ᴇʀʀᴏʀ ʀᴇǫᴜᴇsᴛ {ᴇ}")
            ʀᴇᴛᴜʀɴ
        ɪғ (
            ʟᴏᴄᴀᴛɪᴏɴ_ɪᴘ
            ᴀɴᴅ ʟᴏᴄᴀᴛɪᴏɴ_ᴄᴏᴅᴇ
            ᴀɴᴅ ʟᴏᴄᴀᴛɪᴏɴ_ɴᴀᴍᴇ
            ᴀɴᴅ ʟᴏᴄᴀᴛɪᴏɴ_ʀᴇɢɪᴏɴ
            ᴀɴᴅ ʟᴏᴄᴀᴛɪᴏɴ_ᴄɪᴛʏ
            ᴀɴᴅ ʟᴏᴄᴀᴛɪᴏɴ_ᴢɪᴘ
            ᴀɴᴅ ʟᴏᴄᴀᴛɪᴏɴ_ᴢᴏɴᴇ
            ᴀɴᴅ ʟᴏᴄᴀᴛɪᴏɴ_ᴄᴀʀᴅ
        ):
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ = ""
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ɪᴘ ᴀᴅᴅʀᴇss:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ɪᴘ}\ɴ"
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ᴄᴏᴜɴᴛʀʏ ᴄᴏᴅᴇ:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ᴄᴏᴅᴇ}\ɴ"
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ᴄᴏᴜɴᴛʀʏ ɴᴀᴍᴇ:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ɴᴀᴍᴇ}\ɴ"
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ʀᴇɢɪᴏɴ ɴᴀᴍᴇ:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ʀᴇɢɪᴏɴ}\ɴ"
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ᴄɪᴛʏ ɴᴀᴍᴇ:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ᴄɪᴛʏ}\ɴ"
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ᴢɪᴘ ᴄᴏᴅᴇ:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ᴢɪᴘ}\ɴ"
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ᴛɪᴍᴇ ᴢᴏɴᴇ:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ᴢᴏɴᴇ}\ɴ"
            ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ += ғ"<ʙ>ᴅᴀᴛᴀ ᴄᴀʀᴅ:</ʙ> {ʟᴏᴄᴀᴛɪᴏɴ_ᴄᴀʀᴅ}\ɴ"
            ᴀᴡᴀɪᴛ ʀᴀɴ.ᴇᴅɪᴛ_ᴛᴇxᴛ(ʟᴏᴄᴀᴛɪᴏɴ_ᴛᴀʀɢᴇᴛ)
        ᴇʟsᴇ:
            ᴀᴡᴀɪᴛ ʀᴀɴ.ᴇᴅɪᴛ_ᴛᴇxᴛ("ɴᴏᴛ ᴅᴀᴛᴀ ɪᴘ ᴀᴅᴅʀᴇss")
    ᴇʟsᴇ:
        ᴀᴡᴀɪᴛ ʀᴀɴ.ᴇᴅɪᴛ_ᴛᴇxᴛ(
            "sᴏʀʀʏ, ᴛʜᴇʀᴇ ᴡᴀs ᴀɴ ᴇʀʀᴏʀ ᴘʀᴏᴄᴇssɪɴɢ ʏᴏᴜʀ ʀᴇǫᴜᴇsᴛ. ᴘʟᴇᴀsᴇ ᴛʀʏ ᴀɢᴀɪɴ ʟᴀᴛᴇʀ"
        )

